analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/spi_regs.h
/**@} end of group SPI_DATA32_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_DATA16 SPI_DATA16
 * @brief    Register for reading and writing the FIFO.
 * @{
 */
#define MXC_F_SPI_DATA16_DATA_POS                      0 /**< DATA16_DATA Position */
#define MXC_F_SPI_DATA16_DATA                          ((uint16_t)(0xFFFFUL << MXC_F_SPI_DATA16_DATA_POS)) /**< DATA16_DATA Mask */

/**@} end of group SPI_DATA16_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_DATA8 SPI_DATA8
 * @brief    Register for reading and writing the FIFO.
 * @{
 */
#define MXC_F_SPI_DATA8_DATA_POS                       0 /**< DATA8_DATA Position */
#define MXC_F_SPI_DATA8_DATA                           ((uint8_t)(0xFFUL << MXC_F_SPI_DATA8_DATA_POS)) /**< DATA8_DATA Mask */

/**@} end of group SPI_DATA8_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_MSTR_CNTL SPI_MSTR_CNTL
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPI_MSTR_CNTL_SPIEN_POS                  0 /**< MSTR_CNTL_SPIEN Position */
#define MXC_F_SPI_MSTR_CNTL_SPIEN                      ((uint32_t)(0x1UL << MXC_F_SPI_MSTR_CNTL_SPIEN_POS)) /**< MSTR_CNTL_SPIEN Mask */

#define MXC_F_SPI_MSTR_CNTL_MMEN_POS                   1 /**< MSTR_CNTL_MMEN Position */
#define MXC_F_SPI_MSTR_CNTL_MMEN                       ((uint32_t)(0x1UL << MXC_F_SPI_MSTR_CNTL_MMEN_POS)) /**< MSTR_CNTL_MMEN Mask */

#define MXC_F_SPI_MSTR_CNTL_SSIO_POS                   4 /**< MSTR_CNTL_SSIO Position */
#define MXC_F_SPI_MSTR_CNTL_SSIO                       ((uint32_t)(0x1UL << MXC_F_SPI_MSTR_CNTL_SSIO_POS)) /**< MSTR_CNTL_SSIO Mask */

#define MXC_F_SPI_MSTR_CNTL_START_POS                  5 /**< MSTR_CNTL_START Position */
#define MXC_F_SPI_MSTR_CNTL_START                      ((uint32_t)(0x1UL << MXC_F_SPI_MSTR_CNTL_START_POS)) /**< MSTR_CNTL_START Mask */

#define MXC_F_SPI_MSTR_CNTL_SSCTRL_POS                 8 /**< MSTR_CNTL_SSCTRL Position */
#define MXC_F_SPI_MSTR_CNTL_SSCTRL                     ((uint32_t)(0x1UL << MXC_F_SPI_MSTR_CNTL_SSCTRL_POS)) /**< MSTR_CNTL_SSCTRL Mask */

#define MXC_F_SPI_MSTR_CNTL_SS_POS                     16 /**< MSTR_CNTL_SS Position */
#define MXC_F_SPI_MSTR_CNTL_SS                         ((uint32_t)(0x7UL << MXC_F_SPI_MSTR_CNTL_SS_POS)) /**< MSTR_CNTL_SS Mask */
#define MXC_V_SPI_MSTR_CNTL_SS_SS0                     ((uint32_t)0x1UL) /**< MSTR_CNTL_SS_SS0 Value */
#define MXC_S_SPI_MSTR_CNTL_SS_SS0                     (MXC_V_SPI_MSTR_CNTL_SS_SS0 << MXC_F_SPI_MSTR_CNTL_SS_POS) /**< MSTR_CNTL_SS_SS0 Setting */
#define MXC_V_SPI_MSTR_CNTL_SS_SS1                     ((uint32_t)0x2UL) /**< MSTR_CNTL_SS_SS1 Value */
#define MXC_S_SPI_MSTR_CNTL_SS_SS1                     (MXC_V_SPI_MSTR_CNTL_SS_SS1 << MXC_F_SPI_MSTR_CNTL_SS_POS) /**< MSTR_CNTL_SS_SS1 Setting */
#define MXC_V_SPI_MSTR_CNTL_SS_SS2                     ((uint32_t)0x4UL) /**< MSTR_CNTL_SS_SS2 Value */
#define MXC_S_SPI_MSTR_CNTL_SS_SS2                     (MXC_V_SPI_MSTR_CNTL_SS_SS2 << MXC_F_SPI_MSTR_CNTL_SS_POS) /**< MSTR_CNTL_SS_SS2 Setting */

/**@} end of group SPI_MSTR_CNTL_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_TRNMT_SIZE SPI_TRNMT_SIZE
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPI_TRNMT_SIZE_TX_NUM_CHAR_POS           0 /**< TRNMT_SIZE_TX_NUM_CHAR Position */
#define MXC_F_SPI_TRNMT_SIZE_TX_NUM_CHAR               ((uint32_t)(0xFFFFUL << MXC_F_SPI_TRNMT_SIZE_TX_NUM_CHAR_POS)) /**< TRNMT_SIZE_TX_NUM_CHAR Mask */

#define MXC_F_SPI_TRNMT_SIZE_RX_NUM_CHAR_POS           16 /**< TRNMT_SIZE_RX_NUM_CHAR Position */
#define MXC_F_SPI_TRNMT_SIZE_RX_NUM_CHAR               ((uint32_t)(0xFFFFUL << MXC_F_SPI_TRNMT_SIZE_RX_NUM_CHAR_POS)) /**< TRNMT_SIZE_RX_NUM_CHAR Mask */

/**@} end of group SPI_TRNMT_SIZE_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_STATIC_CONFIG SPI_STATIC_CONFIG
 * @brief    Register for controlling SPI peripheral.
 * @{
 */
#define MXC_F_SPI_STATIC_CONFIG_PHASE_POS              0 /**< STATIC_CONFIG_PHASE Position */
#define MXC_F_SPI_STATIC_CONFIG_PHASE                  ((uint32_t)(0x1UL << MXC_F_SPI_STATIC_CONFIG_PHASE_POS)) /**< STATIC_CONFIG_PHASE Mask */

#define MXC_F_SPI_STATIC_CONFIG_CLKPOL_POS             1 /**< STATIC_CONFIG_CLKPOL Position */
#define MXC_F_SPI_STATIC_CONFIG_CLKPOL                 ((uint32_t)(0x1UL << MXC_F_SPI_STATIC_CONFIG_CLKPOL_POS)) /**< STATIC_CONFIG_CLKPOL Mask */

#define MXC_F_SPI_STATIC_CONFIG_NUMBITS_POS            8 /**< STATIC_CONFIG_NUMBITS Position */
#define MXC_F_SPI_STATIC_CONFIG_NUMBITS                ((uint32_t)(0xFUL << MXC_F_SPI_STATIC_CONFIG_NUMBITS_POS)) /**< STATIC_CONFIG_NUMBITS Mask */
#define MXC_V_SPI_STATIC_CONFIG_NUMBITS_0              ((uint32_t)0x0UL) /**< STATIC_CONFIG_NUMBITS_0 Value */
#define MXC_S_SPI_STATIC_CONFIG_NUMBITS_0              (MXC_V_SPI_STATIC_CONFIG_NUMBITS_0 << MXC_F_SPI_STATIC_CONFIG_NUMBITS_POS) /**< STATIC_CONFIG_NUMBITS_0 Setting */

#define MXC_F_SPI_STATIC_CONFIG_DATAWIDTH_POS          12 /**< STATIC_CONFIG_DATAWIDTH Position */
#define MXC_F_SPI_STATIC_CONFIG_DATAWIDTH              ((uint32_t)(0x3UL << MXC_F_SPI_STATIC_CONFIG_DATAWIDTH_POS)) /**< STATIC_CONFIG_DATAWIDTH Mask */
#define MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_MONO         ((uint32_t)0x0UL) /**< STATIC_CONFIG_DATAWIDTH_MONO Value */
#define MXC_S_SPI_STATIC_CONFIG_DATAWIDTH_MONO         (MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_MONO << MXC_F_SPI_STATIC_CONFIG_DATAWIDTH_POS) /**< STATIC_CONFIG_DATAWIDTH_MONO Setting */
#define MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_DUAL         ((uint32_t)0x1UL) /**< STATIC_CONFIG_DATAWIDTH_DUAL Value */
#define MXC_S_SPI_STATIC_CONFIG_DATAWIDTH_DUAL         (MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_DUAL << MXC_F_SPI_STATIC_CONFIG_DATAWIDTH_POS) /**< STATIC_CONFIG_DATAWIDTH_DUAL Setting */
#define MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_QUAD         ((uint32_t)0x2UL) /**< STATIC_CONFIG_DATAWIDTH_QUAD Value */
#define MXC_S_SPI_STATIC_CONFIG_DATAWIDTH_QUAD         (MXC_V_SPI_STATIC_CONFIG_DATAWIDTH_QUAD << MXC_F_SPI_STATIC_CONFIG_DATAWIDTH_POS) /**< STATIC_CONFIG_DATAWIDTH_QUAD Setting */

#define MXC_F_SPI_STATIC_CONFIG_3WIRE_POS              15 /**< STATIC_CONFIG_3WIRE Position */
#define MXC_F_SPI_STATIC_CONFIG_3WIRE                  ((uint32_t)(0x1UL << MXC_F_SPI_STATIC_CONFIG_3WIRE_POS)) /**< STATIC_CONFIG_3WIRE Mask */

#define MXC_F_SPI_STATIC_CONFIG_SSPOL_POS              16 /**< STATIC_CONFIG_SSPOL Position */
#define MXC_F_SPI_STATIC_CONFIG_SSPOL                  ((uint32_t)(0xFFUL << MXC_F_SPI_STATIC_CONFIG_SSPOL_POS)) /**< STATIC_CONFIG_SSPOL Mask */
#define MXC_V_SPI_STATIC_CONFIG_SSPOL_SS0_HIGH         ((uint32_t)0x1UL) /**< STATIC_CONFIG_SSPOL_SS0_HIGH Value */
#define MXC_S_SPI_STATIC_CONFIG_SSPOL_SS0_HIGH         (MXC_V_SPI_STATIC_CONFIG_SSPOL_SS0_HIGH << MXC_F_SPI_STATIC_CONFIG_SSPOL_POS) /**< STATIC_CONFIG_SSPOL_SS0_HIGH Setting */
#define MXC_V_SPI_STATIC_CONFIG_SSPOL_SS1_HIGH         ((uint32_t)0x2UL) /**< STATIC_CONFIG_SSPOL_SS1_HIGH Value */
#define MXC_S_SPI_STATIC_CONFIG_SSPOL_SS1_HIGH         (MXC_V_SPI_STATIC_CONFIG_SSPOL_SS1_HIGH << MXC_F_SPI_STATIC_CONFIG_SSPOL_POS) /**< STATIC_CONFIG_SSPOL_SS1_HIGH Setting */
#define MXC_V_SPI_STATIC_CONFIG_SSPOL_SS2_HIGH         ((uint32_t)0x4UL) /**< STATIC_CONFIG_SSPOL_SS2_HIGH Value */
#define MXC_S_SPI_STATIC_CONFIG_SSPOL_SS2_HIGH         (MXC_V_SPI_STATIC_CONFIG_SSPOL_SS2_HIGH << MXC_F_SPI_STATIC_CONFIG_SSPOL_POS) /**< STATIC_CONFIG_SSPOL_SS2_HIGH Setting */

/**@} end of group SPI_STATIC_CONFIG_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_SS_TIME SPI_SS_TIME
 * @brief    Register for controlling SPI peripheral/Slave Select Timing.
 * @{
 */
#define MXC_F_SPI_SS_TIME_PRE_POS                      0 /**< SS_TIME_PRE Position */
#define MXC_F_SPI_SS_TIME_PRE                          ((uint32_t)(0xFFUL << MXC_F_SPI_SS_TIME_PRE_POS)) /**< SS_TIME_PRE Mask */
#define MXC_V_SPI_SS_TIME_PRE_256                      ((uint32_t)0x0UL) /**< SS_TIME_PRE_256 Value */
#define MXC_S_SPI_SS_TIME_PRE_256                      (MXC_V_SPI_SS_TIME_PRE_256 << MXC_F_SPI_SS_TIME_PRE_POS) /**< SS_TIME_PRE_256 Setting */

#define MXC_F_SPI_SS_TIME_POST_POS                     8 /**< SS_TIME_POST Position */
#define MXC_F_SPI_SS_TIME_POST                         ((uint32_t)(0xFFUL << MXC_F_SPI_SS_TIME_POST_POS)) /**< SS_TIME_POST Mask */
#define MXC_V_SPI_SS_TIME_POST_256                     ((uint32_t)0x0UL) /**< SS_TIME_POST_256 Value */
#define MXC_S_SPI_SS_TIME_POST_256                     (MXC_V_SPI_SS_TIME_POST_256 << MXC_F_SPI_SS_TIME_POST_POS) /**< SS_TIME_POST_256 Setting */

#define MXC_F_SPI_SS_TIME_INACT_POS                    16 /**< SS_TIME_INACT Position */
#define MXC_F_SPI_SS_TIME_INACT                        ((uint32_t)(0xFFUL << MXC_F_SPI_SS_TIME_INACT_POS)) /**< SS_TIME_INACT Mask */
#define MXC_V_SPI_SS_TIME_INACT_256                    ((uint32_t)0x0UL) /**< SS_TIME_INACT_256 Value */
#define MXC_S_SPI_SS_TIME_INACT_256                    (MXC_V_SPI_SS_TIME_INACT_256 << MXC_F_SPI_SS_TIME_INACT_POS) /**< SS_TIME_INACT_256 Setting */

