analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/spi_regs.h
/**@} end of group SPI_INT_FL_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_INT_EN SPI_INT_EN
 * @brief    Register for enabling interrupts.
 * @{
 */
#define MXC_F_SPI_INT_EN_TXTHRLD_POS                   0 /**< INT_EN_TXTHRLD Position */
#define MXC_F_SPI_INT_EN_TXTHRLD                       ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_TXTHRLD_POS)) /**< INT_EN_TXTHRLD Mask */

#define MXC_F_SPI_INT_EN_TXEMPTY_POS                   1 /**< INT_EN_TXEMPTY Position */
#define MXC_F_SPI_INT_EN_TXEMPTY                       ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_TXEMPTY_POS)) /**< INT_EN_TXEMPTY Mask */

#define MXC_F_SPI_INT_EN_RXTHRLD_POS                   2 /**< INT_EN_RXTHRLD Position */
#define MXC_F_SPI_INT_EN_RXTHRLD                       ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_RXTHRLD_POS)) /**< INT_EN_RXTHRLD Mask */

#define MXC_F_SPI_INT_EN_RXFULL_POS                    3 /**< INT_EN_RXFULL Position */
#define MXC_F_SPI_INT_EN_RXFULL                        ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_RXFULL_POS)) /**< INT_EN_RXFULL Mask */

#define MXC_F_SPI_INT_EN_SSA_POS                       4 /**< INT_EN_SSA Position */
#define MXC_F_SPI_INT_EN_SSA                           ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_SSA_POS)) /**< INT_EN_SSA Mask */

#define MXC_F_SPI_INT_EN_SSD_POS                       5 /**< INT_EN_SSD Position */
#define MXC_F_SPI_INT_EN_SSD                           ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_SSD_POS)) /**< INT_EN_SSD Mask */

#define MXC_F_SPI_INT_EN_FAULT_POS                     8 /**< INT_EN_FAULT Position */
#define MXC_F_SPI_INT_EN_FAULT                         ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_FAULT_POS)) /**< INT_EN_FAULT Mask */

#define MXC_F_SPI_INT_EN_ABORT_POS                     9 /**< INT_EN_ABORT Position */
#define MXC_F_SPI_INT_EN_ABORT                         ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_ABORT_POS)) /**< INT_EN_ABORT Mask */

#define MXC_F_SPI_INT_EN_MSTRDONE_POS                  11 /**< INT_EN_MSTRDONE Position */
#define MXC_F_SPI_INT_EN_MSTRDONE                      ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_MSTRDONE_POS)) /**< INT_EN_MSTRDONE Mask */

#define MXC_F_SPI_INT_EN_TXOVR_POS                     12 /**< INT_EN_TXOVR Position */
#define MXC_F_SPI_INT_EN_TXOVR                         ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_TXOVR_POS)) /**< INT_EN_TXOVR Mask */

#define MXC_F_SPI_INT_EN_TXUNDR_POS                    13 /**< INT_EN_TXUNDR Position */
#define MXC_F_SPI_INT_EN_TXUNDR                        ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_TXUNDR_POS)) /**< INT_EN_TXUNDR Mask */

#define MXC_F_SPI_INT_EN_RXOVR_POS                     14 /**< INT_EN_RXOVR Position */
#define MXC_F_SPI_INT_EN_RXOVR                         ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_RXOVR_POS)) /**< INT_EN_RXOVR Mask */

#define MXC_F_SPI_INT_EN_RXUNDR_POS                    15 /**< INT_EN_RXUNDR Position */
#define MXC_F_SPI_INT_EN_RXUNDR                        ((uint32_t)(0x1UL << MXC_F_SPI_INT_EN_RXUNDR_POS)) /**< INT_EN_RXUNDR Mask */

/**@} end of group SPI_INT_EN_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_WAKE_FL SPI_WAKE_FL
 * @brief    Register for wake up flags. All bits in this register are write 1 to clear.
 * @{
 */
#define MXC_F_SPI_WAKE_FL_TXTHRLD_POS                  0 /**< WAKE_FL_TXTHRLD Position */
#define MXC_F_SPI_WAKE_FL_TXTHRLD                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_FL_TXTHRLD_POS)) /**< WAKE_FL_TXTHRLD Mask */

#define MXC_F_SPI_WAKE_FL_TXEMPTY_POS                  1 /**< WAKE_FL_TXEMPTY Position */
#define MXC_F_SPI_WAKE_FL_TXEMPTY                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_FL_TXEMPTY_POS)) /**< WAKE_FL_TXEMPTY Mask */

#define MXC_F_SPI_WAKE_FL_RXTHRLD_POS                  2 /**< WAKE_FL_RXTHRLD Position */
#define MXC_F_SPI_WAKE_FL_RXTHRLD                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_FL_RXTHRLD_POS)) /**< WAKE_FL_RXTHRLD Mask */

#define MXC_F_SPI_WAKE_FL_RXFULL_POS                   3 /**< WAKE_FL_RXFULL Position */
#define MXC_F_SPI_WAKE_FL_RXFULL                       ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_FL_RXFULL_POS)) /**< WAKE_FL_RXFULL Mask */

/**@} end of group SPI_WAKE_FL_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_WAKE_EN SPI_WAKE_EN
 * @brief    Register for wake up enable.
 * @{
 */
#define MXC_F_SPI_WAKE_EN_TXTHRLD_POS                  0 /**< WAKE_EN_TXTHRLD Position */
#define MXC_F_SPI_WAKE_EN_TXTHRLD                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_EN_TXTHRLD_POS)) /**< WAKE_EN_TXTHRLD Mask */

#define MXC_F_SPI_WAKE_EN_TXEMPTY_POS                  1 /**< WAKE_EN_TXEMPTY Position */
#define MXC_F_SPI_WAKE_EN_TXEMPTY                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_EN_TXEMPTY_POS)) /**< WAKE_EN_TXEMPTY Mask */

#define MXC_F_SPI_WAKE_EN_RXTHRLD_POS                  2 /**< WAKE_EN_RXTHRLD Position */
#define MXC_F_SPI_WAKE_EN_RXTHRLD                      ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_EN_RXTHRLD_POS)) /**< WAKE_EN_RXTHRLD Mask */

#define MXC_F_SPI_WAKE_EN_RXFULL_POS                   3 /**< WAKE_EN_RXFULL Position */
#define MXC_F_SPI_WAKE_EN_RXFULL                       ((uint32_t)(0x1UL << MXC_F_SPI_WAKE_EN_RXFULL_POS)) /**< WAKE_EN_RXFULL Mask */

/**@} end of group SPI_WAKE_EN_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_STAT SPI_STAT
 * @brief    SPI Status register.
 * @{
 */
#define MXC_F_SPI_STAT_BUSY_POS                        0 /**< STAT_BUSY Position */
#define MXC_F_SPI_STAT_BUSY                            ((uint32_t)(0x1UL << MXC_F_SPI_STAT_BUSY_POS)) /**< STAT_BUSY Mask */

/**@} end of group SPI_STAT_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32520_INCLUDE_SPI_REGS_H_
